In [1]:
import pandas as pd
import numpy as np

In [6]:
data = [[10, 13, np.nan, 7],
        [2, np.nan, 3, 1],
        [21, 31, np.nan, 51],
        [21, 31, np.nan, 51]]

dataDF = pd.DataFrame(data)
dataDF

    0     1    2   3
0  10  13.0  NaN   7
1   2   NaN  3.0   1
2  21  31.0  NaN  51
3  21  31.0  NaN  51

In [3]:
# 결측치 처리 ===================================
dataDF.isnull().sum() #컬럼별로 결측시 갯수를 반환

0    0
1    1
2    2
3    0
dtype: int64

In [7]:
# 결측치 처리 
# 기본값 행 방향, 한 개라도 NaN이 있으면 삭제
dataDF.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [8]:
dataDF.dropna(axis=1) #열방향에 nan이 있다면 삭제하라

    0   3
0  10   7
1   2   1
2  21  51
3  21  51

In [10]:
#[기본값 변경] 행 방향, 모두가 NaN이 있으면 삭제
dataDF.dropna(how="all") # 하나도 삭제 안함

    0     1    2   3
0  10  13.0  NaN   7
1   2   NaN  3.0   1
2  21  31.0  NaN  51
3  21  31.0  NaN  51

In [12]:
#[기본값 변경] 행 방향, 모두가 NaN이 있으면 삭제
dataDF.dropna(axis=1, how="all") #axis=1 축방 기준으로
#컬럼방향으로도 Nan이 있는 애들은 없으니까 삭제 안함
#한개도 안개도 안지워지는 이유는 모두가 nan이 아니까 2컬럼이 안지워지는것
#how가 any (디폴트값)이라면 다 지워버린다.

    0     1    2   3
0  10  13.0  NaN   7
1   2   NaN  3.0   1
2  21  31.0  NaN  51
3  21  31.0  NaN  51

In [18]:
# [기본값 변경] 컬럼 또는 행 데이터의 정상 데이터의 갯수를 기준으로
# 그 이하인 경우 삭제!
# 행방향 최소한 정상데이터가 3개는 나와야할 것 같아
# 4개가 나오게 하면 다 사라진다.
# 정상 데이터가 3개 미만인 행 삭제
dataDF.dropna(thresh=3)

    0     1    2   3
0  10  13.0  NaN   7
1   2   NaN  3.0   1
2  21  31.0  NaN  51
3  21  31.0  NaN  51

In [22]:
dataDF.dropna(axis=1, thresh=1)

    0     1    2   3
0  10  13.0  NaN   7
1   2   NaN  3.0   1
2  21  31.0  NaN  51
3  21  31.0  NaN  51

In [26]:
#나이랑 지역별 연령별을 보고 싶다.
#구간을 정해서, 
#특정을 컬럼을 지정해서 그 컬럼만 NaN체크
dataDF

    0     1    2   3
0  10  13.0  NaN   7
1   2   NaN  3.0   1
2  21  31.0  NaN  51
3  21  31.0  NaN  51

In [30]:
dataDF.dropna(subset=[1])

    0    2   3
0  10  NaN   7
1   2  3.0   1
2  21  NaN  51
3  21  NaN  51

In [32]:
dataDF.dropna(subset=[2])
#행으로 보는데, 2번 컬럼을 기준이 없다면 삭제

   0   1    2  3
1  2 NaN  3.0  1

In [33]:
dataDF.dropna(axis= 1, subset=[2])

# dataDF.dropna(axis= 1, subset=[2]) 이거라면 열로 보고, 컬럼2를 봐서 nan이 있다면 그 [2]열을 삭제하라는거군요?

    0     1   3
0  10  13.0   7
1   2   NaN   1
2  21  31.0  51
3  21  31.0  51